In [1]:
# Importing required libraries
import pandas as pd

In [7]:
# Reading the csv file 
data = pd.read_csv('titanic_data.csv')

In [90]:
# Exploring the data
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [91]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [92]:
# Funtion to get the type of data
type(data)

# 1. DataFrame 2.Series

pandas.core.frame.DataFrame

In [93]:
# Extracting a single column from the DataFrame to form a Series
newdata = data['PassengerId']

In [94]:
type(newdata)

pandas.core.series.Series

In [103]:
# To remove rows that has NAN values
data.dropna(inplace = True)

In [96]:
# Conditional slicing
new1 = data['Age'] > 40
new2 = data['PassengerId'] > 500

In [97]:
# Conditional slicing with mulitple conditions
data_with_conditions = data[(data['Age'] > 40) & (data['PassengerId'] > 500)]

In [104]:
# View all values in a column
data['Age'].values

array([38.  , 35.  , 54.  ,  4.  , 58.  , 34.  , 28.  , 19.  , 49.  ,
       65.  , 45.  , 29.  , 25.  , 23.  , 46.  , 71.  , 23.  , 21.  ,
       47.  , 24.  , 32.5 , 54.  , 19.  , 37.  , 24.  , 36.5 , 22.  ,
       61.  , 56.  , 50.  ,  1.  ,  3.  , 44.  , 58.  ,  2.  , 40.  ,
       31.  , 32.  , 38.  , 35.  , 44.  , 37.  , 29.  , 62.  , 30.  ,
       52.  , 40.  , 58.  , 35.  , 37.  , 63.  , 19.  , 36.  ,  2.  ,
       50.  ,  0.92, 17.  , 30.  , 24.  , 18.  , 31.  , 40.  , 36.  ,
       36.  , 16.  , 45.5 , 38.  , 29.  , 41.  , 45.  ,  2.  , 24.  ,
       24.  , 22.  , 60.  , 24.  , 25.  , 27.  , 36.  , 23.  , 24.  ,
       33.  , 32.  , 28.  , 50.  , 14.  , 64.  ,  4.  , 52.  , 30.  ,
       49.  , 65.  , 48.  , 47.  , 23.  , 25.  , 35.  , 58.  , 55.  ,
       54.  , 25.  , 16.  , 18.  , 36.  , 47.  , 34.  , 30.  , 44.  ,
       45.  , 22.  , 36.  , 50.  , 17.  , 48.  , 39.  , 53.  , 36.  ,
       39.  , 39.  , 36.  , 18.  , 60.  , 52.  , 49.  , 40.  ,  4.  ,
       42.  , 61.  , 21.  , 80.  , 32.  , 24.  , 48.  , 56.  , 58.  ,
       47.  , 31.  , 36.  , 27.  , 15.  , 31.  , 49.  , 42.  , 18.  ,
       35.  , 42.  , 24.  , 48.  , 19.  , 38.  , 27.  , 27.  , 29.  ,
       35.  , 36.  , 21.  , 70.  , 19.  ,  6.  , 33.  , 36.  , 51.  ,
       57.  , 43.  , 17.  , 29.  , 46.  , 49.  , 11.  , 39.  , 33.  ,
       52.  , 27.  , 39.  , 16.  , 51.  , 48.  , 31.  , 47.  , 33.  ,
       56.  , 19.  , 26.  ])

In [99]:
# Get all unique values present in a column
data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [100]:
# Get frequency of each unique element.
data['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [101]:
#Drop a column by name
data.drop(['Name'], axis = 1)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [109]:
# Arranging the rows by sorting particular columns with ascending or descending pattern
data.sort_values(by = ['Age','PassengerId'], ascending = [False,False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.00,1,1,WE/P 5735,71.0000,B22,S
456,457,0,1,"Millet, Mr. Francis Davis",male,65.00,0,0,13509,26.5500,E38,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.00,0,1,113509,61.9792,B30,C
...,...,...,...,...,...,...,...,...,...,...,...,...
340,341,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,26.0000,F2,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
205,206,0,3,"Strom, Miss. Telma Matilda",female,2.00,0,1,347054,10.4625,G6,S
183,184,1,2,"Becker, Master. Richard F",male,1.00,2,1,230136,39.0000,F4,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S

In [8]:
# To create a ew DataFrame from the columns of an older DataFrame

data1 = data[['PassengerId','Survived','Age']]